id: household

Choices:  
- heinz41  
- heinz32  
- heinz28  
- hunts32  

variables  
- disp (1/0)  
- feat (1/0)  
- price (Log?)

Loading the dataset

In [2]:
import pickle
dataset = pickle.load(open("datasets/n 1000 - seed 1234 - time 2019-06-19-154935.pickle","rb"))

Describing the data

In [3]:
print("Number of datasets generated is %d \n" % dataset['n'])

print("Coefficients")
print(dataset['c'])

print("\n Data preview")
dataset['data'][0].head()

Number of datasets generated is 1000

Coefficients
[0.8, 0.2, -0.5, 0.9, 1.1, -0.5, 0.1, 0.5, 0.25]

 Data preview

,id,disp.heinz41,disp.heinz32,disp.heinz28,disp.hunts32,feat.heinz41,feat.heinz32,feat.heinz28,feat.hunts32,price.heinz41,price.heinz32,price.heinz28,price.hunts32,choice,choiceindex
0,1,0,0,0,0,0,0,0,0,4.6,3.7,5.2,3.4,heinz32,1
1,1,0,0,0,0,0,0,0,0,4.6,4.3,5.2,4.4,heinz32,1
2,1,0,0,0,0,0,1,0,0,4.6,2.5,4.6,4.8,heinz32,1
3,1,0,0,0,0,0,0,0,0,4.6,3.7,5.2,3.4,hunts32,3
4,1,0,0,0,0,0,0,1,0,4.6,3.0,4.6,4.8,heinz41,0

Running the model

In [2]:
from src.main import Mixedlogit
import pickle

dataset = pickle.load(open("datasets/n 1000 - seed 1234 - time 2019-06-19-154935.pickle","rb"))

mixedlogit = Mixedlogit(dataset)

mixedlogit.fit(drawtype="pseudo", n_draws=1, subset=0.001, verbose=1, method="Nelder-Mead")

Fitting 1 datasets

Fitting model 1

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
0,0.490,0.711,-0.085,0.558,0.961,-0.194,2.051,2.153,0.615,324.072,0.909

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
1,1.048,-0.111,-0.549,0.781,0.997,-0.578,0.640,0.706,0.602,106.313,0.269

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
2,0.959,-0.075,-0.528,0.840,1.017,-0.730,0.576,0.638,0.646,98.339,0.251

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
3,0.822,0.041,-0.327,1.000,1.082,-0.592,0.468,0.526,0.632,74.936,0.199

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
4,0.833,0.125,-0.375,1.018,1.081,-0.565,0.455,0.514,0.634,67.349,0.187

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
5,0.769,0.105,-0.436,1.048,1.076,-0.536,0.449,0.519,0.630,66.047,0.184

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
6,0.833,0.111,-0.418,1.130,1.116,-0.560,0.417,0.548,0.590,62.989,0.180

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
7,0.759,0.171,-0.346,0.704,0.964,-0.540,0.358,0.461,0.516,51.655,0.158

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
8,0.753,0.151,-0.376,0.787,0.978,-0.531,0.615,0.256,0.491,82.782,0.219

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
9,0.726,0.144,-0.451,0.684,1.391,-0.519,0.571,0.247,0.457,78.380,0.229

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
10,0.748,0.143,-0.452,0.772,1.294,-0.531,0.494,0.250,0.414,65.812,0.185

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
11,0.792,0.122,-0.464,0.913,1.186,-0.551,0.398,0.227,0.322,49.835,0.144

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
12,0.831,0.105,-0.486,1.045,1.082,-0.565,0.270,0.183,0.209,37.249,0.136

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
13,0.829,0.103,-0.499,1.042,1.087,-0.561,0.198,0.147,0.148,32.280,0.141

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
14,0.819,0.106,-0.501,1.032,1.097,-0.554,0.140,0.115,0.101,28.027,0.150

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
15,0.814,0.107,-0.502,1.029,1.100,-0.551,0.100,0.091,0.069,25.304,0.159

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
16,0.812,0.107,-0.505,1.029,1.102,-0.549,0.071,0.071,0.047,29.858,0.168

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
17,0.810,0.107,-0.506,1.030,1.103,-0.548,0.050,0.056,0.032,33.210,0.175

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
18,0.809,0.108,-0.507,1.030,1.104,-0.547,0.035,0.044,0.021,35.616,0.180

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
19,0.809,0.108,-0.508,1.030,1.105,-0.547,0.025,0.034,0.014,37.331,0.184

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
20,0.808,0.108,-0.508,1.030,1.106,-0.546,0.017,0.027,0.009,38.544,0.188

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
21,0.808,0.108,-0.509,1.030,1.107,-0.546,0.012,0.021,0.006,39.390,0.190

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
22,0.808,0.109,-0.509,1.030,1.107,-0.546,0.008,0.016,0.004,39.968,0.192

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
23,0.807,0.109,-0.509,1.030,1.107,-0.546,0.006,0.013,0.003,40.350,0.193

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
24,0.807,0.109,-0.509,1.030,1.107,-0.546,0.004,0.011,0.002,40.597,0.194

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
25,0.807,0.109,-0.509,1.030,1.107,-0.546,0.003,0.009,0.002,40.744,0.194

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
26,0.807,0.109,-0.509,1.030,1.107,-0.546,0.003,0.009,0.001,40.810,0.194

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
27,0.807,0.109,-0.509,1.030,1.107,-0.546,0.003,0.008,0.001,40.853,0.195

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
28,0.807,0.109,-0.509,1.030,1.107,-0.546,0.003,0.008,0.001,40.883,0.195

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
29,0.807,0.109,-0.509,1.030,1.107,-0.546,0.002,0.008,0.001,40.902,0.195

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
30,0.807,0.109,-0.509,1.030,1.107,-0.546,0.002,0.008,0.001,40.920,0.195

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
31,0.807,0.109,-0.509,1.030,1.107,-0.546,0.002,0.007,0.001,41.013,0.195

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
32,0.807,0.109,-0.509,1.030,1.107,-0.546,0.001,0.007,0.001,41.091,0.195

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
33,0.808,0.108,-0.509,1.031,1.105,-0.546,0.000,0.088,0.000,39.474,0.173

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
34,0.808,0.108,-0.510,1.031,1.105,-0.546,0.000,0.085,0.000,39.548,0.174

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
35,0.807,0.108,-0.511,1.031,1.103,-0.546,0.000,0.085,0.000,39.533,0.174

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
36,0.807,0.108,-0.511,1.031,1.102,-0.546,0.000,0.085,0.000,39.530,0.174

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
37,0.807,0.108,-0.511,1.031,1.103,-0.546,0.000,0.085,0.000,39.531,0.174

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
38,0.807,0.108,-0.511,1.031,1.103,-0.546,0.000,0.085,0.000,39.531,0.174

,a h41,a h32,a h28,m disp,m feat,m price,s disp,s feat,s price,MAPE,RMSE
39,0.807,0.108,-0.511,1.031,1.103,-0.546,0.000,0.085,0.000,39.531,0.174

Optimization done, time elapsed: 0:00:13

   duration: 13.367718935012817
        fun: 3387.289457521607
   hess_inv: array([[ 4.30656805e-03,  1.28693050e-04,  2.11474500e-03,
        -1.46208130e-03, -5.39720425e-04, -2.07442121e-03,
        -2.93575806e-01,  3.15437423e-02, -2.53790689e-01],
       [ 1.28693050e-04,  3.91600858e-03,  2.82462935e-03,
         2.84805926e-05, -2.27420522e-03,  1.18471157e-03,
        -5.21039418e-01,  4.65850114e-02, -4.49740458e-01],
       [ 2.11474500e-03,  2.82462935e-03,  8.73019036e-03,
        -1.50555293e-03, -4.16609651e-03, -4.61053444e-04,
        -7.73715362e-01,  7.14355375e-02, -6.68091450e-01],
       [-1.46208130e-03,  2.84805926e-05, -1.50555293e-03,
         7.94167968e-03, -1.33172593e-03,  1.36979536e-03,
        -9.21600967e-02,  7.12005812e-03, -8.00628372e-02],
       [-5.39720425e-04, -2.27420522e-03, -4.16609651e-03,
        -1.33172593e-03,  1.13155602e-02, -4.64659545e-04,
         3.76864245e-01, -3.63116493e-02,  3.24423859e-01],
       [-2.07442121e-03,  1.18471157e-03, -4.61053444e-04,
         1.36979536e-03, -4.64659545e-04,  2.16305608e-03,
        -3.61989449e-02,  4.45750844e-05, -3.15610649e-02],
       [-2.93575806e-01, -5.21039418e-01, -7.73715362e-01,
        -9.21600967e-02,  3.76864245e-01, -3.61989449e-02,
         1.08139565e+02, -9.97661976e+00,  9.34037038e+01],
       [ 3.15437423e-02,  4.65850114e-02,  7.14355375e-02,
         7.12005812e-03, -3.63116493e-02,  4.45750844e-05,
        -9.97661976e+00,  9.27487044e-01, -8.61757292e+00],
       [-2.53790689e-01, -4.49740458e-01, -6.68091450e-01,
        -8.00628372e-02,  3.24423859e-01, -3.15610649e-02,
         9.34037038e+01, -8.61757292e+00,  8.06845447e+01]])
 iterations:     a h41  a h32  a h28  m disp  m feat  m price  s disp  s feat  s price  \
0   0.490  0.711 -0.085   0.558   0.961   -0.194   2.051   2.153    0.615
1   1.048 -0.111 -0.549   0.781   0.997   -0.578   0.640   0.706    0.602
2   0.959 -0.075 -0.528   0.840   1.017   -0.730   0.576   0.638    0.646
3   0.822  0.041 -0.327   1.000   1.082   -0.592   0.468   0.526    0.632
4   0.833  0.125 -0.375   1.018   1.081   -0.565   0.455   0.514    0.634
5   0.769  0.105 -0.436   1.048   1.076   -0.536   0.449   0.519    0.630
6   0.833  0.111 -0.418   1.130   1.116   -0.560   0.417   0.548    0.590
7   0.759  0.171 -0.346   0.704   0.964   -0.540   0.358   0.461    0.516
8   0.753  0.151 -0.376   0.787   0.978   -0.531   0.615   0.256    0.491
9   0.726  0.144 -0.451   0.684   1.391   -0.519   0.571   0.247    0.457
10  0.748  0.143 -0.452   0.772   1.294   -0.531   0.494   0.250    0.414
11  0.792  0.122 -0.464   0.913   1.186   -0.551   0.398   0.227    0.322
12  0.831  0.105 -0.486   1.045   1.082   -0.565   0.270   0.183    0.209
13  0.829  0.103 -0.499   1.042   1.087   -0.561   0.198   0.147    0.148
14  0.819  0.106 -0.501   1.032   1.097   -0.554   0.140   0.115    0.101
15  0.814  0.107 -0.502   1.029   1.100   -0.551   0.100   0.091    0.069
16  0.812  0.107 -0.505   1.029   1.102   -0.549   0.071   0.071    0.047
17  0.810  0.107 -0.506   1.030   1.103   -0.548   0.050   0.056    0.032
18  0.809  0.108 -0.507   1.030   1.104   -0.547   0.035   0.044    0.021
19  0.809  0.108 -0.508   1.030   1.105   -0.547   0.025   0.034    0.014
20  0.808  0.108 -0.508   1.030   1.106   -0.546   0.017   0.027    0.009
21  0.808  0.108 -0.509   1.030   1.107   -0.546   0.012   0.021    0.006
22  0.808  0.109 -0.509   1.030   1.107   -0.546   0.008   0.016    0.004
23  0.807  0.109 -0.509   1.030   1.107   -0.546   0.006   0.013    0.003
24  0.807  0.109 -0.509   1.030   1.107   -0.546   0.004   0.011    0.002
25  0.807  0.109 -0.509   1.030   1.107   -0.546   0.003   0.009    0.002
26  0.807  0.109 -0.509   1.030   1.107   -0.546   0.003   0.009    0.001
27  0.807  0.109 -0.509   1.030   1.107   -0.546   0.003   0.008    0.001
28  0.807  0.109 -0.509   1.030   1.107   -0.546   0.003   0.008    0.001
29  0.807  0.109 -0.509   1.030   1.107   -0.546   0.002   0.008    0.001
30  0.807  0.109 -0.509   1.030   1.107   -0.546   0.002   0.008    0.001
31  0.807  0.109 -0.509   1.030   1.107   -0.546   0.002   0.007    0.001
32  0.807  0.109 -0.509   1.030   1.107   -0.546   0.001   0.007    0.001
33  0.808  0.108 -0.509   1.031   1.105   -0.546   0.000   0.088    0.000
34  0.808  0.108 -0.510   1.031   1.105   -0.546   0.000   0.085    0.000
35  0.807  0.108 -0.511   1.031   1.103   -0.546   0.000   0.085    0.000
36  0.807  0.108 -0.511   1.031   1.102   -0.546   0.000   0.085    0.000
37  0.807  0.108 -0.511   1.031   1.103   -0.546   0.000   0.085    0.000
38  0.807  0.108 -0.511   1.031   1.103   -0.546   0.000   0.085    0.000
39  0.807  0.108 -0.511   1.031   1.103   -0.546   0.000   0.085    0.000

      MAPE  RMSE
0  324.072 0.909
1  106.313 0.269
2   98.339 0.251
3   74.936 0.199
4   67.349 0.187
5   66.047 0.184
6   62.989 0.180
7   51.655 0.158
8   82.782 0.219
9   78.380 0.229
10  65.812 0.185
11  49.835 0.144
12  37.249 0.136
13  32.280 0.141
14  28.027 0.150
15  25.304 0.159
16  29.858 0.168
17  33.210 0.175
18  35.616 0.180
19  37.331 0.184
20  38.544 0.188
21  39.390 0.190
22  39.968 0.192
23  40.350 0.193
24  40.597 0.194
25  40.744 0.194
26  40.810 0.194
27  40.853 0.195
28  40.883 0.195
29  40.902 0.195
30  40.920 0.195
31  41.013 0.195
32  41.091 0.195
33  39.474 0.173
34  39.548 0.174
35  39.533 0.174
36  39.530 0.174
37  39.531 0.174
38  39.531 0.174
39  39.531 0.174
        jac: array([ 6.10351562e-05,  6.10351562e-04,  6.40869141e-04,  2.74658203e-04,
       -1.83105469e-04,  5.79833984e-04,  0.00000000e+00,  0.00000000e+00,
        0.00000000e+00])
    message: 'Desired error not necessarily achieved due to precision loss.'
       nfev: 1963
        nit: 40
       njev: 177
     status: 2
    success: False
          x: array([ 8.06731327e-01,  1.08161713e-01, -5.10713961e-01,  1.03117281e+00,
        1.10250343e+00, -5.45773091e-01,  1.73265369e-08,  8.54021528e-02,
        5.77261966e-08])